In [4]:
import pandas as pd
import numpy as np

In [5]:
## Read the three files into python as dataframes ####
file1 = pd.read_csv('/Users/sebastiangunther/Documents/GitHub/lab-customer-analysis-round-1/files_for_lab/csv_files/file1.csv')
file2 = pd.read_csv('/Users/sebastiangunther/Documents/GitHub/lab-customer-analysis-round-1/files_for_lab/csv_files/file2.csv')
file3 = pd.read_csv('/Users/sebastiangunther/Documents/GitHub/lab-customer-analysis-round-1/files_for_lab/csv_files/file3.csv')

In [6]:
# to doublecheck if its a dataframe..
print(type(file1), type(file2),type(file3))

<class 'pandas.core.frame.DataFrame'> <class 'pandas.core.frame.DataFrame'> <class 'pandas.core.frame.DataFrame'>

In [7]:
## Show the DataFrame's shape. ####
print(file1.shape)
print(file2.shape)
print(file3.shape)

(4008, 11)
(996, 11)
(7070, 11)

In [8]:
file1.head(1)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [9]:
file2.head(1)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car

In [10]:
file3.head(1)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

In [11]:
column_names1 = file1.columns
column_names2 = file2.columns
column_names3 = file3.columns
print(column_names1)
print(column_names2)
print(column_names3)

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')
Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')
Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [12]:
## Standardize header names ####
cols1 = []
for n in range(len(file1.columns)):
    cols1.append(file1.columns[n].lower())
    
cols2 = []
for n in range(len(file2.columns)):
    cols2.append(file2.columns[n].lower())

cols3 = []
for n in range(len(file3.columns)):
    cols3.append(file3.columns[n].lower())

print(cols1)
print(cols2)
print(cols3)

# try to do this in one for Anweisung.... maybe like x,y,z in range(len(file1.columns) & 
#.                                                            range(len(file2.columns) &
#.                                                            range(len(file3.columns):

['customer', 'st', 'gender', 'education', 'customer lifetime value', 'income', 'monthly premium auto', 'number of open complaints', 'policy type', 'vehicle class', 'total claim amount']
['customer', 'st', 'gender', 'education', 'customer lifetime value', 'income', 'monthly premium auto', 'number of open complaints', 'total claim amount', 'policy type', 'vehicle class']
['customer', 'state', 'customer lifetime value', 'education', 'gender', 'income', 'monthly premium auto', 'number of open complaints', 'policy type', 'total claim amount', 'vehicle class']

In [13]:
file1.columns = cols1
file2.columns = cols2
file3.columns = cols3

In [14]:
## Rearrange the columns in the dataframe as needed ####
# rearrange the colums like in file1 - this is for combining them later

file1 = file1[['customer', 'st', 'gender', 'education', 'customer lifetime value',
               'income', 'monthly premium auto', 'number of open complaints', 'policy type',
               'vehicle class', 'total claim amount']]

In [15]:
file1.head(1)

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [16]:
file2 = file2[['customer', 'st', 'gender', 'education', 'customer lifetime value',
               'income', 'monthly premium auto', 'number of open complaints', 'policy type',
               'vehicle class', 'total claim amount']]

In [17]:
file2.head(1)

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,Personal Auto,Four-Door Car,633.6

In [18]:
# change the name State into st (like in the other file1 & 2)

file3 = file3.rename(columns={ 'state':'st'})

In [19]:
file3 = file3[['customer', 'st', 'gender', 'education', 'customer lifetime value',
               'income', 'monthly premium auto', 'number of open complaints', 'policy type',
               'vehicle class', 'total claim amount']]

In [20]:
file3.head(1)

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,SA25987,Washington,M,High School or Below,3479.137523,0,104,0,Personal Auto,Two-Door Car,499.2

In [21]:
## Concatenate the three dataframes ####

# !! write somethihng which doublecheck if the colums are the same !! ##

# Concatenate the files

file_concat = pd.concat([file1,file2,file3], axis=0)
file_concat.head(10)

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
5,OC83172,Oregon,F,Bachelor,825629.78%,62902.0,69.0,1/0/00,Personal Auto,Two-Door Car,159.383042
6,XZ87318,Oregon,F,College,538089.86%,55350.0,67.0,1/0/00,Corporate Auto,Four-Door Car,321.600000
7,CF85061,Arizona,M,Master,721610.03%,0.0,101.0,1/0/00,Corporate Auto,Four-Door Car,363.029680
8,DY87989,Oregon,M,Bachelor,2412750.40%,14072.0,71.0,1/0/00,Corporate Auto,Four-Door Car,511.200000
9,BQ94931,Oregon,F,College,738817.81%,28812.0,93.0,1/0/00,Special Auto,Four-Door Car,425.527834

In [22]:
print(file_concat.shape)

(12074, 11)

In [23]:
file_concat.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer lifetime value       object
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

In [24]:
## Which columns are numerical? ####
file_concat._get_numeric_data()

## Which columns are categorical ####

       income  monthly premium auto  total claim amount
0         0.0                1000.0            2.704934
1         0.0                  94.0         1131.464935
2     48767.0                 108.0          566.472247
3         0.0                 106.0          529.881344
4     36357.0                  68.0           17.269323
...       ...                   ...                 ...
7065  71941.0                  73.0          198.234764
7066  21604.0                  79.0          379.200000
7067      0.0                  85.0          790.784983
7068  21941.0                  96.0          691.200000
7069      0.0                  77.0          369.600000

[12074 rows x 3 columns]